ttkpark/safelink/test_bluetooth_sensor/sdkconfig.defaults
# ESP32-C6 Target Configuration
CONFIG_IDF_TARGET="esp32c6"

# NimBLE Configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n

# NimBLE Memory Configuration
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=y

# NimBLE GATT Configuration
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="ESP32C6_Sensor"
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=31

# NimBLE Security Configuration
CONFIG_BT_NIMBLE_SM_SC_DEBUG_KEYS=y

# NimBLE Host Configuration
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CCCDS=8

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# Logging Configuration
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# NVS Configuration
CONFIG_NVS_ENCRYPTION=n

# ADC Configuration
CONFIG_ADC_DISABLE_DAC=y

# I2C Configuration
CONFIG_I2C_MASTER_TIMEOUT_MS=1000 